package com.nestdev.solid_practice.structure_patterns.bridge


/**
 * Абстракция - образный слой управления чем-либо.
 * Он не делает работу самостоятельно, а делегирует её слою реализации
 * (иногда называемому платформой)
 */

/**
 * 1. Абстракция - содержит управляющую логику. Код абстрации делегирует реальную работу связанному объекту реализации.
 * 2. Реализация - задаёт общий интерфейс для всех реализаций. Все методы, которые здесь описаны, бцдцт доступны из класса абстракции и его подклассов.
 *
 * Конкретные реализации содержат платформо-зависимый код.
 *
 *
 */
fun main() {

}